app/views/assignments/show.html.erb

SELECT "uploads".* FROM "uploads" WHERE "uploads"."assignment_id" = 3
---
  <b> Uploads </b>
  <% @assignment.uploads.each do |upload| %>