app/views/groups/show.html.erb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
---
  <b>Teacher:</b>
  <%= Teacher.find(@group.teacher_id).name %>

SELECT "assignments".* FROM "assignments" WHERE "assignments"."group_id" = 1
---
  <b>Asignments</b>
  <%@group.assignments.each do |asignment|%>

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT 1  [["id", 1]]
---
	<%= link_to 'Edit', edit_group_path(@group) %> |
	<%= link_to 'Back', Administrator.find(session[:id]) %>

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
<% if (session[:type] == 'student') %>
	<%= link_to 'Back', Student.find(session[:id]) %> |