app/views/teachers/index.html.erb

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT 1  [["id", 1]]
---
<%= link_to 'New Teacher', new_teacher_path %>
<%= link_to 'Go back', Administrator.find(session[:id])%>