app/views/asistences/_form.html.erb

  <div>
  <% @group.students.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."group_id" = 1