app/controllers/asistences_controller.rb

  def show
    @asistence = Asistence.find(params[:id])
---
SELECT "asistences".* FROM "asistences" WHERE "asistences"."id" = ? LIMIT 1  [["id", "25"]]

  def new
    @group = Teacher.find(session[:id]).group
    @asistence = Asistence.new
    @asistence.group = @group
    @group.asistences << @asistence
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "asistences" ("created_at", "dateOfClass", "leson", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 16 May 2012 20:13:27 UTC +00:00], ["dateOfClass", nil], ["leson", nil], ["updated_at", Wed, 16 May 2012 20:13:27 UTC +00:00]]

  def create
    @asistence = Asistence.new(params[:asistence])

    respond_to do |format|
      if @asistence.save
---
INSERT INTO "asistences" ("created_at", "dateOfClass", "leson", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 18 May 2012 13:56:49 UTC +00:00], ["dateOfClass", Fri, 18 May 2012], ["leson", "Lesson1"], ["updated_at", Fri, 18 May 2012 13:56:49 UTC +00:00]]

  def update
    @asistence = Asistence.find(params[:id])
    @group = @asistence.group

    respond_to do |format|
      if @asistence.update_attributes(params[:asistence])
---
SELECT "asistences".* FROM "asistences" WHERE "asistences"."id" = ? LIMIT 1  [["id", "25"]]
UPDATE "asistences" SET "dateOfClass" = '2012-05-16', "leson" = 'lesson1', "updated_at" = '2012-05-16 21:03:35.400989' WHERE "asistences"."id" = 26