app/controllers/groups_controller.rb

  def index
    #@teacher = Teacher.find(params[teacher_id])
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    #@teacher = Teacher.find(params[:teacher_id])
    @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @group = Group.find(params[:id])
    @teacher = Teacher.find(@group.teacher_id)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("created_at", "level", "teacher_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 16 May 2012 14:14:13 UTC +00:00], ["level", "Group1"], ["teacher_id", 1], ["updated_at", Wed, 16 May 2012 14:14:13 UTC +00:00]]