app/controllers/sessions_controller.rb

SELECT "administrators".* FROM "administrators"
SELECT "students".* FROM "students"
SELECT "teachers".* FROM "teachers"
---
  def create

    if (params[:type] == 'admin')
      @admins = Administrator.all
      @admins.each do |admin|
	if (admin.uname == params[:user] && admin.password == params[:password])
	   session[:name]= admin.uname
	   session[:id]=admin.id
	   session[:type]='admin'
	   @user = admin
	end
      end
    elsif(params[:type] == 'student')
      @sudents = Student.all
      @sudents.each do |student|
	if (student.uname == params[:user] && student.password == params[:password])
	   session[:name]= student.uname
	   session[:id]=student.id
	   session[:type]='student'
	   @user = student
	end
      end
    elsif(params[:type]=='teacher')
      @teachers = Teacher.all