app/controllers/students_controller.rb

  def new
    @student = Student.new
    if(session[:type]=='teacher')
	@student.group = Teacher.find(session[:id]).group
	@group = @student.group
	@group.students << @student
---
SELECT "groups".* FROM "groups" WHERE "groups"."teacher_id" = 1 LIMIT 1
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "students" ("address", "cc", "created_at", "email", "group_id", "lastname", "name", "password", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("address", "cc", "created_at", "email", "group_id", "lastname", "name", "password", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "students" SET "address" = 'asdg', "cc" = 1015, "email" = 'agsdg', "password" = 'clave', "lastname" = 'Example', "name" = 'Eddyjim', "updated_at" = '2012-05-16 18:46:39.592029', "phone" = 1235 WHERE "students"."id" = 1