app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @teacher = Teacher.find(params[:id])

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @teacher = Teacher.find(params[:id])

INSERT INTO "teachers" ("created_at", "email", "group_id", "lastname", "name", "password", "phone", "uname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @teacher = Teacher.new(params[:teacher])

    respond_to do |format|
      if @teacher.save