app/controllers/uploads_controller.rb

  def index
    @uploads = Upload.all
---
SELECT "uploads".* FROM "uploads"

  def show
    @upload = Upload.find(params[:id])
    @student = Student.find(@upload.student_id)
    @group = @student.group
    @assignment = Assignment.find(@upload.assignment_id)
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", 3]]

  def new
    @upload = Upload.new
    @student = Student.find(session[:id])
    @group = @student.group
    @assignment = Assignment.find(params[:assignment_id])
    @student.uploads << @upload
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "uploads" ("assignment_id", "created_at", "file", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["assignment_id", nil], ["created_at", Wed, 16 May 2012 18:55:28 UTC +00:00], ["file", nil], ["student_id", 1], ["updated_at", Wed, 16 May 2012 18:55:28 UTC +00:00]]

  def update
    @upload = Upload.find(params[:id])

    respond_to do |format|
      if @upload.update_attributes(params[:upload])
        format.html { redirect_to @upload.assignment.group, :notice => 'Upload was successfully updated.' }
---
SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "uploads" SET "file" = 'jasjfasdfj', "updated_at" = '2012-05-16 18:59:40.879313' WHERE "uploads"."id" = 4
SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = 4 LIMIT 1
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 1 LIMIT 1